In [1]:
!pip install pandas
import pandas as pd

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [16]:
#Series Data Structure: Just like a 1-D array and can have multiple types of data
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(series.shape)

0    1
1    2
2    3
3    4
4    5
dtype: int64
(5,)

In [11]:
# Series with different index
data = [1,2,3,'a']
index = ['a','b','c','d']

series = pd.Series(data,index=index)
print(series)

a    1
b    2
c    3
d    a
dtype: object

In [2]:
## DATA FRAME: A 2-d tabular data structure
data =  {
    'col1':[1,2,3],
    'col2':[2,3,None],

    'col3':["AZAN","USMAN","UMAR"]
}

df = pd.DataFrame(data)
print(df)

   col1  col2   col3
0     1   2.0   AZAN
1     2   3.0  USMAN
2     3   NaN   UMAR

In [4]:
# creating dataframe by list of dictionaries
data = [
    {'col1':1,'col2':2,'col3':"AZAN"},
    {'col1':2,'col2':3,'col3':"USMAN"},
    {'col1':3,'col2':None,'col3':"UMAR"}
]

df = pd.DataFrame(data)
print(df)

   col1  col2   col3
0     1   2.0   AZAN
1     2   3.0  USMAN
2     3   NaN   UMAR

In [6]:
#get top n and last n rows
print(df.head(2))

print(df.tail(1))

   col1  col2   col3
0     1   2.0   AZAN
1     2   3.0  USMAN
   col1  col2  col3
2     3   NaN  UMAR

In [9]:
#Accessing data from dataframe
# if i pick a column it will give me the series

print((df['col1']))
print((type(df['col1'])))

0    1
1    2
2    3
Name: col1, dtype: int64
<class 'pandas.core.series.Series'>

In [11]:
# data manipulations with dataframes

# adding a new column
df['new_col'] = [1,2,3]
df

   col1  col2   col3  new_col
0     1   2.0   AZAN        1
1     2   3.0  USMAN        2
2     3   NaN   UMAR        3

In [14]:
# droping column
df.drop('new_col',axis = 1,inplace=True)
df

KeyError: "['new_col'] not found in axis"

In [16]:
# Arithmetics in column
df['col1'] = df['col1']+1
df

   col1  col2   col3
0     2   2.0   AZAN
1     3   3.0  USMAN
2     4   NaN   UMAR

DATA MANIPULATION WITH PANDAS AND NUMPY: EDA

In [20]:
data = pd.read_csv('data.csv')

data.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      50 non-null     object
 1   Category  50 non-null     object
 2   Value     47 non-null     float64
 3   Product   50 non-null     object
 4   Sales     46 non-null     float64
 5   Region    50 non-null     object
dtypes: float64(2), object(4)
memory usage: 2.5+ KB

In [22]:
data.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [23]:
## HANDLING MISSING VALUES

#find the missing value
data.isnull().any()

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [26]:
# FIlling missing values with mean

data['Sales_filled'] = data["Sales"].fillna(data["Sales"].mean())
data

          Date Category  Value   Product  Sales Region  Sales_filled
0   2023-01-01        A   28.0  Product1  754.0   East    754.000000
1   2023-01-02        B   39.0  Product3  110.0  North    110.000000
2   2023-01-03        C   32.0  Product2  398.0   East    398.000000
3   2023-01-04        B    8.0  Product1  522.0   East    522.000000
4   2023-01-05        B   26.0  Product3  869.0  North    869.000000
5   2023-01-06        B   54.0  Product3  192.0   West    192.000000
6   2023-01-07        A   16.0  Product1  936.0   East    936.000000
7   2023-01-08        C   89.0  Product1  488.0   West    488.000000
8   2023-01-09        C   37.0  Product3  772.0   West    772.000000
9   2023-01-10        A   22.0  Product2  834.0   West    834.000000
10  2023-01-11        B    7.0  Product1  842.0  North    842.000000
11  2023-01-12        B   60.0  Product2    NaN   West    557.130435
12  2023-01-13        A   70.0  Product3  628.0  South    628.000000
13  2023-01-14        A   69.0  Product1  423.0   East    423.000000
14  2023-01-15        A   47.0  Product2  893.0   West    893.000000
15  2023-01-16        C    NaN  Product1  895.0  North    895.000000
16  2023-01-17        C   93.0  Product2  511.0  South    511.000000
17  2023-01-18        C    NaN  Product1  108.0   West    108.000000
18  2023-01-19        A   31.0  Product2  578.0   West    578.000000
19  2023-01-20        A   59.0  Product1  736.0   East    736.000000
20  2023-01-21        C   82.0  Product3  606.0  South    606.000000
21  2023-01-22        C   37.0  Product2  992.0  South    992.000000
22  2023-01-23        B   62.0  Product3  942.0  North    942.000000
23  2023-01-24        C   92.0  Product2  342.0   West    342.000000
24  2023-01-25        A   24.0  Product2  458.0   East    458.000000
25  2023-01-26        C   95.0  Product1  584.0   West    584.000000
26  2023-01-27        C   71.0  Product2  619.0  North    619.000000
27  2023-01-28        C   56.0  Product2  224.0  North    224.000000
28  2023-01-29        B    NaN  Product3  617.0  North    617.000000
29  2023-01-30        C   51.0  Product2  737.0  South    737.000000
30  2023-01-31        B   50.0  Product3  735.0   West    735.000000
31  2023-02-01        A   17.0  Product2  189.0   West    189.000000
32  2023-02-02        B   63.0  Product3  338.0  South    338.000000
33  2023-02-03        C   27.0  Product3    NaN   East    557.130435
34  2023-02-04        C   70.0  Product3  669.0   West    669.000000
35  2023-02-05        B   60.0  Product2    NaN   West    557.130435
36  2023-02-06        C   36.0  Product3  177.0   East    177.000000
37  2023-02-07        C    2.0  Product1    NaN  North    557.130435
38  2023-02-08        C   94.0  Product1  408.0  South    408.000000
39  2023-02-09        A   62.0  Product1  155.0   West    155.000000
40  2023-02-10        B   15.0  Product1  578.0   East    578.000000
41  2023-02-11        C   97.0  Product1  256.0   East    256.000000
42  2023-02-12        A   93.0  Product3  164.0   West    164.000000
43  2023-02-13        A   43.0  Product3  949.0   East    949.000000
44  2023-02-14        A   96.0  Product3  830.0   East    830.000000
45  2023-02-15        B   99.0  Product2  599.0   West    599.000000
46  2023-02-16        B    6.0  Product1  938.0  South    938.000000
47  2023-02-17        B   69.0  Product3  143.0   West    143.000000
48  2023-02-18        C   65.0  Product3  182.0  North    182.000000
49  2023-02-19        C   11.0  Product3  708.0  North    708.000000

In [30]:
# change column name 
data=data.rename(columns={"Date":"Sales Date"})
data.head()

   Sales Date Category  Value   Product  Sales Region  Sales_filled
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

In [36]:
# Grouping and Aggregations
data.groupby("Product")['Value'].mean().head()

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64

In [37]:
# Grouping by multiple columns
data.groupby(['Product','Region'])['Value'].mean()

Product   Region
Product1  East      41.714286
          North      4.500000
          South     50.000000
          West      82.000000
Product2  East      28.000000
          North     63.500000
          South     60.333333
          West      53.500000
Product3  East      50.500000
          North     40.600000
          South     71.666667
          West      62.166667
Name: Value, dtype: float64

In [40]:
# Multiple aggregations

data.groupby(['Product','Region'])['Value'].agg(['mean','count']).head()

                      mean  count
Product  Region
Product1 East    41.714286      7
         North    4.500000      2
         South   50.000000      2
         West    82.000000      3
Product2 East    28.000000      2

In [48]:
# multiple column aggregations

data.groupby(['Product','Region'])[['Value','Sales']].agg(['mean','count']).head()

                     Value             Sales
                      mean count        mean count
Product  Region
Product1 East    41.714286     7  600.714286     7
         North    4.500000     2  868.500000     2
         South   50.000000     2  673.000000     2
         West    82.000000     3  333.750000     4
Product2 East    28.000000     2  428.000000     2

In [53]:
# MERGING/JOINING THE DATA FRAMES

df1 = pd.DataFrame({
    'key':[1,2,3],
    "name":["Azan","Usman","Umar"]
})

df2 = pd.DataFrame({
    'key':[1,2,4],
    "age":[21,22,24]
})

In [54]:
df1

   key   name
0    1   Azan
1    2  Usman
2    3   Umar

In [55]:
df2

   key  age
0    1   21
1    2   22
2    4   24

In [56]:
# Inner join

pd.merge(df1,df2,on="key",how="inner").head()

   key   name  age
0    1   Azan   21
1    2  Usman   22

In [57]:
# Outer join

pd.merge(df1,df2,on="key",how="outer").head()

   key   name   age
0    1   Azan  21.0
1    2  Usman  22.0
2    3   Umar   NaN
3    4    NaN  24.0

In [58]:
#lEFT join

pd.merge(df1,df2,on="key",how="left").head()

   key   name   age
0    1   Azan  21.0
1    2  Usman  22.0
2    3   Umar   NaN

In [59]:
# right join

pd.merge(df1,df2,on="key",how="right").head()

   key   name  age
0    1   Azan   21
1    2  Usman   22
2    4    NaN   24